; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	Star3 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
	(supports instrument9 thermograph0)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star2)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 spectrograph1)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation0)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation1)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 spectrograph1)
	(supports instrument13 spectrograph2)
	(supports instrument13 thermograph0)
	(calibration_target instrument13 GroundStation0)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star6)
	(pointing satellite2 Phenomenon5)
	(pointing satellite3 Star3)
	(have_image Phenomenon5 thermograph0)
	(have_image Star6 spectrograph1)
	(have_image Planet7 spectrograph2)
	(have_image Phenomenon8 spectrograph1)
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon10 spectrograph1)
))

)

; plan
1. (turn_to satellite2 phenomenon5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon5)
   goals met: 1 of 9
2. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   goals met: 1 of 9
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 9
4. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 9
6. (take_image satellite1 phenomenon8 instrument2 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 9
8. (take_image satellite1 phenomenon5 instrument2 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 3 of 9
9. (turn_to satellite1 phenomenon10 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon10 instrument2 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 4 of 9
11. (turn_to satellite1 phenomenon9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 9
12. (take_image satellite1 phenomenon9 instrument2 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 5 of 9
13. (turn_to satellite1 planet7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet7)
   goals met: 5 of 9
14. (take_image satellite1 planet7 instrument2 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 6 of 9
15. (turn_to satellite1 star6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star6)
   goals met: 7 of 9
16. (take_image satellite1 star6 instrument2 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 8 of 9
17. (turn_to satellite3 star3 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star3)
   goals met: 9 of 9
